{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Zenovia Rayment-Evans "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Michael O’Driscoll"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Engl 483 "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "April 7, 2025"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Annotations of “Still I Rise” by Maya Angelou"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "\tFor my AVAnnotate project, I chose to add tags alongside the transcription because I wanted Angelou’s words to remain the primary focus of the listening experience. I then noted various literary devices to highlight where Angelou uses these strategies to convey her message. While this method did make it more difficult to be specific about what exactly I wanted to note in Angelou’s reading, I believe this introduction will help connect the different highlighted literary and oral devices to more complex ideas. Angelou uses rhyme, timbre, and meter to invite the listener to connect to her poem through their own human experience. Additionally, with the use of caesura and tempo, Angelou forces the listener to consider further perspectives or offers the ability to empathize further with the experience of African American women."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "\tThis reading of Angelou’s poem begins with an introduction by Angelou that expands the ability to relate the poem to the full human experience, while still highlighting specific experiences. Angelou first describes the universally human experience of going to bed with despair, only to rise in the morning with strength. She uses playful dialogue to connect with the audience, successfully triggering memories of similar moments in people’s lives. She calls specific attention to the “human spirit” and then lists various races, body types, and sexualities. By doing so, Angelou not only includes every person in this moment of humanity, but also lends specific perspectives into different categories that might experience these emotions collectively. By ending her introduction with “we rise” the call-and-response devices she uses in her poem are solidified, inviting her audience to join her in the experience of her poem, rather than merely listening to her. This opens up the possibility for deeper empathy with Angelou. Even though the poem was written in dialogue with her oppressors, the introduction allows the audience to position themselves wherever they feel connected. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "\tAngelou’s repetition of the phrase “I rise” conveys her persistence through every battle.  By using a rhyming sequence, she enables the audience to anticipate this persistence. Aslam notes that Angelou “challenges her enemies by using call-response form in her poetry” (63-64). Angelou is in dialogue with her oppressors, and this sequence helps people to know what will be said next, triggering a mental response that unites the poet and her audience. This call and response strategy is common in African American church gatherings, gaining its origin from West African oral traditions (MacArthur, 56). Therefore, not only is this an invitation to the audience to listen to Angelou, but also to participate in a shared cultural experience. This is further conveyed by rhyming sequences, where she prepares her listeners for her key phrase. When using ‘“-ise” words like “lies,” “tides,” “high,” and “cries,” she primes her audience for the chant-like phrase “I rise.” By giving her audience the chance to expect the phrase, it solidifies its inevitability and strengthens her character. This makes the poem more personal and collective as an experience for the listener, further reinforcing its meaning. Aimen also suggests that by using metaphors based in nature, Angelou makes clear that her rising is a natural phenomenon. For example, in the line “but still like dust i’ll rise,” Aimen connects the idea that dust will rise only when unsettled, just as women will only rise when disturbed by the oppressive forces of men (1711).  I would further expand this argument to suggest that Black people too, will only feel the necessity to rise when they are facing white oppressors. Therefore, through both rhyme and metaphor, Angelou solidifies her inevitability of rising through literary devices of repetition and rhyme, while also drawing connection to race and gender through metaphors of nature. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Angelou also uses caesura in order to allow certain moments of the poem to settle for the listener. This is particularly evident after she says “fat” in the introduction, and when she speaks about her own confidence in her sexuality and its expression through dance. It is notable that both of these moments occur during commentary on sexuality and feminist topics. While many of the topics that Angelou is speaking about could be considered acceptable by the general audience, her comments on sexual liberation and female confidence—specifically within fat confidence—are more contentious, given society’s complex views on whether these ideas are beneficial. Angelou’s performance moves steadily forward, and so by pausing at these moments, she allows the audience time to reflect on their own beliefs about these topics. The pause holds its own form of confidence by signaling that Angelou is comfortable, almost daring anyone who might insert their own opinion. These moments of reflection are less available in other parts of the poem, emphasizing the importance of these topics to Angelou personally.  "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Angelou uses tempo to express a shift when discussing the specific adversity experienced through slavery. The majority of the poem has a tone of sass, with Angelou speaking towards her own circumstance. She focuses on her own strength or confidence, teasing her oppressors about their confusion regarding her ability to rise from adversity. However, when discussing the struggles of her ancestors, her tone shifts from self-pride to an honorary understanding of all that has come before her to bring her to this point. The tempo quickens, and with the metaphor of a “black ocean,” the change of Angelou’s tempo feels like swimming to the surface. By keeping her introduction and the beginning of her poem more inclusive of the human experience, Angelou opens up the ability for a wider audience to empathize with her life. Therefore, when the poem acknowledges the rise of the slave and the escape from struggles that generations of Black people have overcome, the ability to empathize and understand is stronger—especially for those who may have not experienced this directly. The tempo shift grabs the audience’s attention, allowing Angelou to speak about a more serious and solemn aspect of the Black experience. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Maya Angelou’s poem “Still I Rise” is about her personal resilience and collective identity through the enduring spirit of a human, and specifically as a Black woman. Through her use of rhyme, repetition, metaphor, caesura, and tempo, Angelou crafts a poem that invites both personal reflection and empathy from her audience. Her strategic pauses, shifts in tempo, and playful yet forceful language work together to engage listeners emotionally and intellectually, inviting them into a shared experience of rising above adversity. The poem’s connection to race, gender, and the historical struggles of Black people is deepened by Angelou’s use of natural metaphors and her candid exploration of topics like sexual liberation and body confidence. Ultimately, “Still I Rise” stands as a testament to the strength, defiance, and collective strength in womanhood and blackness, urging listeners to rise alongside Angelou, in solidarity and strength. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "\n"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Works Cited"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Aslam, Huma. “A Study of Endurance and Aspiration in Maya Angelou’s Poems The Caged Bird (1968) and Still I Rise (1978).” "
        },
        {
          "text": "Journal of Communication and Cultural Trends",
          "italic": true
        },
        {
          "text": ", vol. 3, no. 1, Mar. 2021. "
        },
        {
          "text": "EBSCOhost",
          "italic": true
        },
        {
          "text": ", https://doi.org/10.32350/jcct.31.04."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Batool, Aimen, et al. “Black Feminism & Intersectionality: A Multimodal Discourse Analysis of Expressional & Relational Value of Language in Maya Angelou’s ‘Still I Rise.’” "
        },
        {
          "text": "Turkish Online Journal of Qualitative Inquiry",
          "italic": true
        },
        {
          "text": ", vol. 13, no. 1, Jan. 2022, pp. 1703–19. "
        },
        {
          "text": "EBSCOhost",
          "italic": true
        },
        {
          "text": ", "
        },
        {
          "type": "link",
          "url": "http://search.ebscohost.com/login.aspx?direct=true&db=ehh&AN=169817139&site=eds-live&scope=site",
          "children": [
            {
              "text": "search.ebscohost.com/login.aspx?direct=true&db=ehh&AN=169817139&site=eds-live&scope=site"
            }
          ]
        },
        {
          "text": "."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "MacArthur, Marit J. “Monotony, the Churches of Poetry Reading, and Sound Studies” "
        },
        {
          "text": "Modern Language Association of America",
          "italic": true
        },
        {
          "text": ", 2016, pp, 38-64 "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        },
        {
          "type": "link",
          "url": "https://drive.google.com/file/d/1IJa85Sv_3YOwYVU8btJOGDqZeYl5EBGf/view",
          "children": [
            {
              "text": "https://drive.google.com/file/d/1IJa85Sv_3YOwYVU8btJOGDqZeYl5EBGf/view"
            }
          ]
        },
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
        }
      ]
    }
  ],
  "title": "Annotation of Angelou's \"Still I Rise\"",
  "autogenerate": {
    "enabled": false,
    "type": "custom"
  },
  "slug": "annotation-of-angelous-still-i-rise",
  "created_at": "2025-04-25T01:41:17.368Z",
  "created_by": "zenoviaraymentevans",
  "updated_at": "2025-04-25T01:41:17.368Z",
  "updated_by": "zenoviaraymentevans"
}